<h1>file handling </h1>

In [29]:
# untuk dari fungsi dari pyrhon ini jarang dipake, yg seirng dipake library pandas untuk projek an
# -penjelasan cara mengkases file: append, write, read. setelah .open(), .close() untuk mencegah kebocoran memory. KALO UDAH pake .open() harus .close() ini udah formatnya.
# -perbedaan csv dan txt
# GASS PRAKTIK -v

# file = open('/Users/ADVAN/Desktop/Smester 1/Smester1-rossee/pk/filehandling-p11/data_mahasiswa.csv', 'r')
# # print(file.read()) # step lain, untuk membaca sebuah file
# file.close()

# file = open('/Users/ADVAN/Desktop/Smester 1/Smester1-rossee/pk/filehandling-p11/data_mahasiswa.csv', 'a') # perhatikan metode file handling: a, r, w
# file.write("""Nama, Nim, Jurusan\n
# Rossi, 1090, SI
# Lutza, 1011, SI
# Nabil, 1009, Si""") gabisa pake 6 koma jirr

# file.write("\nNama, Nim, Prodi\n")
# file.write("Rossi, 1090, SI\n")
# file.write("Nabil, 1009,  SI\n")
# file.write("Lutza, 1011, SI\n")
# file.write("Hasby, 1098, SI\n")


# file = open('/Users/ADVAN/Desktop/Smester 1/Smester1-rossee/pk/filehandling-p11/data_mahasiswa.csv', 'r')
# print(file.read())
# file.close()

# use "with" memungkinkan saat melakukan file handling bisa efisien, 
# contoh

with open('/Users/ADVAN/Desktop/Smester 1/Smester1-rossee/pk/filehandling-p11/data_mahasiswa.csv', 'a') as file:
    file.write("\nNama, Nim, Prodi\n")
    file.write("Rossi, 1090, SI\n")
    file.write("Nabil, 1009,  SI\n")
    file.write("Lutza, 1011, SI\n")
    file.write("Hasby, 1098, SI\n")

<h2> use pandas </h2>
<h4> Kalo kalian punya data, kalian bisa ngatur data yang kalian punya. Entah itu mau diurutkan, ditambahin data, dihapus, diedit, dan segala macem. Pake apa kak ngaturnya? pake nanya. Pake pandas lah üêº</h4>

Dataframe dalam pandas memiliki parameter.Parameter ini adalah data yang akan digunakan untuk membuat DataFrame. Data bisa berupa beberapa tipe, termasuk:

- ndarray: Array NumPy
- dict: Kamus Python
- list: Daftar Python
- series: Series Pandas
- DataFrame: DataFrame lainnya

<h3>Mmebuat Data </h3>

Data dgn list 1 dimensi

In [37]:
dataHewan = pd.DataFrame(['Ayam', 'Badak', 'Sapi', 'Semut'])
dataHewan
# print(dataHewan)

       0
0   Ayam
1  Badak
2   Sapi
3  Semut

Data dgn list

In [39]:
import pandas as pd
hai = [['naute', 'word', 'hai'],
    ['naute', 'word', 'hai'],
    ['naute', 'word', 'hai'],
    ['naute', 'word', 'hai'],
    ['naute', 'word', 'hai'],
    ['naute', 'word', 'hai'],
    ['naute', 'word', 'hai'],
    ['naute', 'word', 'hai'],
    ['naute', 'word', 'hai']]
# header = hai.pop(0)
hai = pd.DataFrame(hai) #columns=header)
# hai = pd.DataFrame(hai)
hai

       0     1    2
0  naute  word  hai
1  naute  word  hai
2  naute  word  hai
3  naute  word  hai
4  naute  word  hai
5  naute  word  hai
6  naute  word  hai
7  naute  word  hai
8  naute  word  hai

Menambahkan nama kolom dalam data

In [42]:
hai = [
    ['nama', 'umur', 'negara'],
    ['Ariski', 22, 'Denmark'],
    ['Kholish', 20, 'Japan'],
    ['Adya', 25, 'Finlandia'],
    ['Wildan', 19, 'Mars'],
    ['Agung', 23, 'Laos'],
    ['Zaki', 30, 'Qatar'],
    ['Lia', 40, 'Argentina'],
    ['Aditya', 28, 'Portugal'],
    ['Fauzul', 27, 'France'],
    ['Sefa', 24, 'Norwegia'],
    ['Tunggul', 26, 'Jombang'],
    ['Fahmi', 21, 'Spanyol']
]
header = hai.pop(0)
hai = pd.DataFrame(hai, columns=header)


hai = pd.DataFrame(hai)
hai

       nama  umur     negara
0    Ariski    22    Denmark
1   Kholish    20      Japan
2      Adya    25  Finlandia
3    Wildan    19       Mars
4     Agung    23       Laos
5      Zaki    30      Qatar
6       Lia    40  Argentina
7    Aditya    28   Portugal
8    Fauzul    27     France
9      Sefa    24   Norwegia
10  Tunggul    26    Jombang
11    Fahmi    21    Spanyol

menggunakan dict (otomatis ada headernya, bcs ada keynya)

In [43]:
hai0 = {
    'Nama' : ['Ariski', 'Kholish', 'Adya', 'Wildan', 'Agung', 'Zaki', 'Lia', 'Aditya', 'Fauzul', 'Sefa', 'Tunggul', 'Fahmi'],
    'Perusahaan' : ['Amazon', 'NASA', 'Microsoft', 'Tesla', 'Meta', 'Tokopedia', 'Google', 'Rockstar', 'Shopee', 'Pertamina', 'OVO', 'OpenAI'],
    'Penghasilan ($)' : [10000000, 8500000, 12000000, 20000000, 18000000, 7500000, 16000000, 8000000, 9000000, 11000000, 9500000, 12500000]
}
hai0 = pd.DataFrame(hai0)
hai0

       Nama Perusahaan  Penghasilan ($)
0    Ariski     Amazon         10000000
1   Kholish       NASA          8500000
2      Adya  Microsoft         12000000
3    Wildan      Tesla         20000000
4     Agung       Meta         18000000
5      Zaki  Tokopedia          7500000
6       Lia     Google         16000000
7    Aditya   Rockstar          8000000
8    Fauzul     Shopee          9000000
9      Sefa  Pertamina         11000000
10  Tunggul        OVO          9500000
11    Fahmi     OpenAI         12500000

save to csv

In [45]:
# <var yg ingin disimpan ke csv>.to_csv('<membuat csv baru>', index=True )
hai.to_csv('model2.csv' , index = False)

MEMBACA DATA DARI CSV

File csv yang telah dibuat dapat dibaca menggunakan pd.read_csv(*file yang dituju*)

In [46]:
hai = pd.read_csv('model2.csv')
hai

       nama  umur     negara
0    Ariski    22    Denmark
1   Kholish    20      Japan
2      Adya    25  Finlandia
3    Wildan    19       Mars
4     Agung    23       Laos
5      Zaki    30      Qatar
6       Lia    40  Argentina
7    Aditya    28   Portugal
8    Fauzul    27     France
9      Sefa    24   Norwegia
10  Tunggul    26    Jombang
11    Fahmi    21    Spanyol

# Method untuk melihat data

Berikut adalah beberapa metode penting untuk melihat data:

*   head(): Menampilkan beberapa baris pertama data.
*   tail(): Menampilkan beberapa baris terakhir data.
*   info(): Menampilkan ringkasan informasi DataFrame.
*   describe(): Memberikan statistik ringkas untuk kolom numerik.

Mengubah tipe data menggunakan .astype()

In [48]:
# hai.head(4) # menampilkan 4 baris pertama
# .head() => nilai defauktnya adalah 5
hai.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nama    12 non-null     object
 1   umur    12 non-null     int64
 2   negara  12 non-null     object
dtypes: int64(1), object(2)
memory usage: 420.0+ bytes

In [36]:
data1 = {
    'Nama' : ['Kambing', 'Sapi', 'Kerbau'],
    'Umur' : [3, 4, 5]
}

data2 = {
    'NamaData1' : ['Kambing', 'Sapi', 'Kerbau'],
    'Alamat' : ['Jember', 'Manchester United', 'Jl. Kalimantan 9']    
}

data1 = pd.DataFrame(data1)
data2 = pd.DataFrame(data2)

dataMerge = pd.merge(left=data1, right=data2, left_on='Umur', right_on='NamaData1')
dataMerge

ValueError: You are trying to merge on int64 and object columns for key 'Umur'. If you wish to proceed you should use pd.concat